<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Importing-the-Packages" data-toc-modified-id="Importing-the-Packages-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Importing the Packages</a></span></li><li><span><a href="#Importing-the-data" data-toc-modified-id="Importing-the-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Importing the data</a></span></li><li><span><a href="#Length-of-the-Time-Period" data-toc-modified-id="Length-of-the-Time-Period-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Length of the Time Period</a></span></li><li><span><a href="#From-Text-to-Date" data-toc-modified-id="From-Text-to-Date-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>From Text to Date</a></span></li><li><span><a href="#Setting-the-index" data-toc-modified-id="Setting-the-index-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Setting the index</a></span></li><li><span><a href="#Setting-the-Desired-Frequency" data-toc-modified-id="Setting-the-Desired-Frequency-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Setting the Desired Frequency</a></span></li><li><span><a href="#Handling-Missing-Values" data-toc-modified-id="Handling-Missing-Values-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Handling Missing Values</a></span></li><li><span><a href="#Simplifying-the-Dataset" data-toc-modified-id="Simplifying-the-Dataset-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Simplifying the Dataset</a></span></li><li><span><a href="#Splitting-the-Data" data-toc-modified-id="Splitting-the-Data-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Splitting the Data</a></span></li></ul></div>

# Importing the Packages

In [1]:
import pandas as pd
import numpy as np

# Importing the data

In [9]:
raw_csv_data = pd.read_csv("datasets/Section_3_Introduction_to_time_series_in_python/Index2018.csv")
df_comp = raw_csv_data.copy()

In [10]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

# Length of the Time Period

- To check the date column summary, pass the column name as the date column will not be shown in describe column with other columns

In [5]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [6]:
df_comp.date.describe()

count           6269
unique          6269
top       24/08/2004
freq               1
Name: date, dtype: object

# From Text to Date

- The above describe is not showing proper summary, so we will convert the column to datetime format

In [12]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [13]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

- Now the describe is showing complete summary

# Setting the index

- In a time series dataset, we have to set the date as the index. This helps in the following
    - Each value should correspond to a time period
    - To examine specific chunks of data between two concrete dates
- Before making the date column as an index, we have to make sure the values are correct, as the index values are fixed and it is not as flexible as other columns to edit values

In [14]:
df_comp.set_index("date", inplace=True)
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

# Setting the Desired Frequency

- If we want to convert the data to a desired frequency, we ise asfreq() to convert data to the desired frequency
- We pass the required frequency as an argument in the above function
    - 'h' = hourly
    - 'w' = weekly
    - 'd' = daily
    - 'm' = monthly
    - 'b' = business days (Excluding Saturdays and Sundays)

In [16]:
df_comp = df_comp.asfreq('d')
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

- As we aggregated the data at date level, we see above that the data had missed 2 days in the above preview
- We need to fix this data if required
    - In the data above, the data has been recorded on business days only, so e can use 'b' to see if we see any nulls

In [17]:
df_comp = df_comp.asfreq('b')
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

- As we see, the data was only recorded on business days. So no fix required as of now

# Handling Missing Values

- Check if we have any missing values

In [18]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

- From above, as we set the data to business days frequency we see that we are missing data for 8 days
- To fix this, we can use fillna()
    - Front filling: Assigns the value of the previous period
    - Back filling: Assigns the value from the next period
    - Assigning the same value: Assign the average to all missing values within the time-series
        - Do this only when the data heavily fluctuates around the mean

In [19]:
# Front filling
df_comp.spx = df_comp.spx.fillna(method="ffill")
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [20]:
# Back filling
df_comp.ftse = df_comp.ftse.fillna(method="bfill")
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [21]:
# Average value filling
df_comp.dax = df_comp.dax.fillna(value=df_comp.dax.mean())
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [22]:
# Average value filling
df_comp.nikkei = df_comp.nikkei.fillna(value=df_comp.nikkei.mean())
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

# Simplifying the Dataset

- We can select only the required columns we want
- This will increase the speed of calculations and data manipulations as we have less data
- Also we can track of data easily as we are looking at limited number of columns

In [23]:
# Create a new column to keep that column for analysis
df_comp['market_value'] = df_comp.spx
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4040.545253    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10711.090000    992.715221
50%    1233.761241   5774.380000  5663.300000  15014.040000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17858.420000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [24]:
# Removing the columns we dont require
del df_comp['spx'], df_comp['dax'], df_comp['ftse'], df_comp['nikkei']

In [25]:
# Check if the columns are removed
df_comp.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

# Splitting the Data

- Many ML models shuffle data and then divide it into Train and Test datasets
- But in time series we cannot shuffle the dataset
- So we choose a time period and split the data
    - Data before that time period will be train dataset
    - Data after that time period will be test dataset
- Usually for train and test, we use 80:20 ratio

In [28]:
# Get the train dataset size
size = int(len(df_comp)*0.8)
size

5021

In [29]:
# Create train dataset
df = df_comp.iloc[:size]
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [30]:
# Create test dataset
df_test = df_comp.iloc[size:]
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623

- The above data is split
- The 2 days gap we see between train and test are Saturday and Sunday